tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18345_tdd.h
#define SSP2BUF5                      522
#define SSP2BUF_BUF6                  523
#define SSP2BUF6                      524
#define SSP2BUF_BUF7                  525
#define SSP2BUF7                      526
#define SSP2ADD_ADD0                  527
#define SSP2ADD0                      528
#define SSP2ADD_ADD                   529
#define SSP2ADD                       530
#define SSP2ADD_ADD1                  531
#define SSP2ADD1                      532
#define SSP2ADD_ADD2                  533
#define SSP2ADD2                      534
#define SSP2ADD_ADD3                  535
#define SSP2ADD3                      536
#define SSP2ADD_ADD4                  537
#define SSP2ADD4                      538
#define SSP2ADD_ADD5                  539
#define SSP2ADD5                      540
#define SSP2ADD_ADD6                  541
#define SSP2ADD6                      542
#define SSP2ADD_ADD7                  543
#define SSP2ADD7                      544
#define SSP2MSK_MSK0                  545
#define SSP2MSK                       546
#define SSP2MSK0                      547
#define SSP2MSK_MSK                   548
#define SSP2MSK_MSK1                  549
#define SSP2MSK1                      550
#define SSP2MSK_MSK2                  551
#define SSP2MSK2                      552
#define SSP2MSK_MSK3                  553
#define SSP2MSK3                      554
#define SSP2MSK_MSK4                  555
#define SSP2MSK4                      556
#define SSP2MSK_MSK5                  557
#define SSP2MSK5                      558
#define SSP2MSK_MSK6                  559
#define SSP2MSK6                      560
#define SSP2MSK_MSK7                  561
#define SSP2MSK7                      562
#define SSP2STAT                      563
#define SSP2STAT_BF                   564
#define SSP2STAT_UA                   565
#define SSP2STAT_R_nW                 566
#define SSP2STAT_S                    567
#define SSP2STAT_P                    568
#define SSP2STAT_D_nA                 569
#define SSP2STAT_CKE                  570
#define SSP2STAT_SMP                  571
#define SSP2CON1                      572
#define SSP2CON1_SSPM                 573
#define SSP2CON1_SSPM0                574
#define SSP2CON1_SSPM1                575
#define SSP2CON1_SSPM2                576
#define SSP2CON1_SSPM3                577
#define SSP2CON1_CKP                  578
#define SSP2CON1_SSPEN                579
#define SSP2CON1_SSPOV                580
#define SSP2CON1_WCOL                 581
#define SSP2CON2                      582
#define SSP2CON2_SEN                  583
#define SSP2CON2_RSEN                 584
#define SSP2CON2_PEN                  585
#define SSP2CON2_RCEN                 586
#define SSP2CON2_ACKEN                587
#define SSP2CON2_ACKDT                588
#define SSP2CON2_ACKSTAT              589
#define SSP2CON2_GCEN                 590
#define SSP2CON3                      591
#define SSP2CON3_DHEN                 592
#define SSP2CON3_AHEN                 593
#define SSP2CON3_SBCDE                594
#define SSP2CON3_SDAHT                595
#define SSP2CON3_BOEN                 596
#define SSP2CON3_SCIE                 597
#define SSP2CON3_PCIE                 598
#define SSP2CON3_ACKTIM               599
#define ODCONA                        600
#define ODCA0                         601
#define ODCA1                         602
#define ODCA2                         603
#define ODCA4                         604
#define ODCA5                         605
#define ODCONB                        606
#define ODCB4                         607
#define ODCB5                         608
#define ODCB6                         609
#define ODCB7                         610
#define ODCONC                        611
#define ODCC0                         612
#define ODCC1                         613
#define ODCC2                         614
#define ODCC3                         615
#define ODCC4                         616
#define ODCC5                         617
#define ODCC6                         618
#define ODCC7                         619
#define CCPR1L                        620
#define CCPR1H                        621
#define CCP1CON                       622
#define CCP1MODE                      623
#define CCP1MODE0                     624
#define CCP1MODE1                     625
#define CCP1MODE2                     626
#define CCP1MODE3                     627
#define CCP1FMT                       628
#define CCP1OUT                       629
#define CCP1EN                        630
#define CCP1CAP                       631
#define CCP1CTS                       632
#define CCP1CTS0                      633
#define CCP1CTS1                      634
#define CCP1CTS2                      635
#define CCP1CTS3                      636
#define CCPR2L                        637
#define CCPR2H                        638
#define CCP2CON                       639
#define CCP2MODE                      640
#define CCP2MODE0                     641
#define CCP2MODE1                     642
#define CCP2MODE2                     643
#define CCP2MODE3                     644
#define CCP2FMT                       645
#define CCP2OUT                       646
#define CCP2EN                        647
#define CCP2CAP                       648
#define CCP2CTS                       649
#define CCP2CTS0                      650
#define CCP2CTS1                      651
#define CCP2CTS2                      652
#define CCP2CTS3                      653
#define CCPTMRS                       654
#define C1TSEL0                       655
#define C1TSEL                        656
#define C1TSEL1                       657
#define C2TSEL0                       658
#define C2TSEL                        659
#define C2TSEL1                       660
#define C3TSEL0                       661
#define C3TSEL                        662
#define C3TSEL1                       663
#define C4TSEL                        664
#define C4TSEL0                       665
#define C4TSEL1                       666
#define SLRCONA                       667
#define SLRA0                         668
#define SLRA1                         669
#define SLRA2                         670
#define SLRA4                         671
#define SLRA5                         672
#define SLRCONB                       673
#define SLRB4                         674
#define SLRB5                         675
#define SLRB6                         676
#define SLRB7                         677
#define SLRCONC                       678
#define SLRC0                         679
#define SLRC1                         680
#define SLRC2                         681
#define SLRC3                         682
#define SLRC4                         683
#define SLRC5                         684
#define SLRC6                         685
#define SLRC7                         686
#define CCPR3L                        687
#define CCPR3H                        688
#define CCP3CON                       689
#define CCP3MODE0                     690
#define CCP3MODE                      691
#define CCP3MODE1                     692
#define CCP3MODE2                     693
#define CCP3MODE3                     694
#define CCP3FMT                       695
#define CCP3OUT                       696
#define CCP3EN                        697
#define CCP3CAP                       698
#define CCP3CTS                       699
#define CCP3CTS0                      700
#define CCP3CTS1                      701
#define CCP3CTS2                      702
#define CCP3CTS3                      703
#define CCPR4L                        704
#define CCPR4H                        705
#define CCP4CON                       706
#define CCP4MODE                      707
#define CCP4MODE0                     708
#define CCP4MODE1                     709
#define CCP4MODE2                     710
#define CCP4MODE3                     711
#define CCP4FMT                       712
#define CCP4OUT                       713
#define CCP4EN                        714
#define CCP4CAP                       715
#define CCP4CTS                       716
#define CCP4CTS0                      717
#define CCP4CTS1                      718
#define CCP4CTS2                      719
#define CCP4CTS3                      720
#define INLVLA                        721
#define INLVLA0                       722
#define INLVLA1                       723
#define INLVLA2                       724
#define INLVLA3                       725
#define INLVLA4                       726
#define INLVLA5                       727
#define INLVLB                        728
#define INLVLB4                       729
#define INLVLB5                       730
#define INLVLB6                       731
#define INLVLB7                       732
#define INLVLC                        733
#define INLVLC0                       734
#define INLVLC1                       735
#define INLVLC2                       736
#define INLVLC3                       737
#define INLVLC4                       738
#define INLVLC5                       739
#define INLVLC6                       740
#define INLVLC7                       741
#define IOCAP                         742
#define IOCAP0                        743
#define IOCAP1                        744
#define IOCAP2                        745
#define IOCAP3                        746
#define IOCAP4                        747
#define IOCAP5                        748
#define IOCAN                         749
#define IOCAN0                        750
#define IOCAN1                        751
#define IOCAN2                        752
#define IOCAN3                        753
#define IOCAN4                        754
#define IOCAN5                        755
#define IOCAF                         756
#define IOCAF0                        757
#define IOCAF1                        758
#define IOCAF2                        759
#define IOCAF3                        760
#define IOCAF4                        761
#define IOCAF5                        762
#define IOCBP                         763
#define IOCBP4                        764
#define IOCBP5                        765
#define IOCBP6                        766
#define IOCBP7                        767
#define IOCBN                         768
#define IOCBN4                        769
#define IOCBN5                        770
#define IOCBN6                        771
#define IOCBN7                        772
#define IOCBF                         773
#define IOCBF4                        774
#define IOCBF5                        775
#define IOCBF6                        776
#define IOCBF7                        777
#define IOCCP                         778
#define IOCCP0                        779
#define IOCCP1                        780
#define IOCCP2                        781
#define IOCCP3                        782
#define IOCCP4                        783
#define IOCCP5                        784
#define IOCCP6                        785
#define IOCCP7                        786
#define IOCCN                         787
#define IOCCN0                        788
#define IOCCN1                        789
#define IOCCN2                        790
#define IOCCN3                        791
#define IOCCN4                        792
#define IOCCN5                        793
#define IOCCN6                        794
#define IOCCN7                        795
#define IOCCF                         796
#define IOCCF0                        797
#define IOCCF1                        798
#define IOCCF2                        799
#define IOCCF3                        800
#define IOCCF4                        801
#define IOCCF5                        802
#define IOCCF6                        803
#define IOCCF7                        804
#define CLKRCON                       805
#define CLKRDIV                       806
#define CLKRDIV0                      807
#define CLKRDIV1                      808
#define CLKRDIV2                      809
#define CLKRDC                        810
#define CLKRDC0                       811
#define CLKRDC1                       812
#define CLKREN                        813
#define MDCON                         814
#define MDBIT                         815
#define MDOUT                         816
#define MDOPOL                        817
#define MDEN                          818
#define MDSRC                         819
#define MDMS0                         820
#define MDMS                          821
#define MDMS1                         822
#define MDMS2                         823
#define MDMS3                         824
#define MDCARH                        825
#define MDCH                          826
#define MDCH0                         827
#define MDCH1                         828
#define MDCH2                         829
#define MDCH3                         830
#define MDCHSYNC                      831
#define MDCHPOL                       832
#define MDCARL                        833
#define MDCL0                         834
#define MDCL                          835
#define MDCL1                         836
#define MDCL2                         837
#define MDCL3                         838
#define MDCLSYNC                      839
#define MDCLPOL                       840
#define CCDNA                         841
#define CCDNA0                        842
#define CCDNA1                        843
#define CCDNA2                        844
#define CCDNA4                        845
#define CCDNA5                        846
#define CCDNB                         847
#define CCDNB4                        848
#define CCDNB5                        849
#define CCDNB6                        850
#define CCDNB7                        851
#define CCDNC                         852
#define CCDNC0                        853
#define CCDNC1                        854
#define CCDNC2                        855
#define CCDNC3                        856
#define CCDNC4                        857
#define CCDNC5                        858
#define CCDNC6                        859
#define CCDNC7                        860
#define TMR3L                         861
#define TMR3H                         862
#define T3CON                         863
#define TMR3ON                        864
#define T3SYNC                        865
#define T3SOSC                        866
#define T3CKPS                        867
#define T3CKPS0                       868
#define T3CKPS1                       869
#define TMR3CS0                       870
#define TMR3CS                        871
#define TMR3CS1                       872
#define T3GCON                        873
#define T3GSS0                        874
#define T3GSS                         875
#define T3GSS1                        876
#define T3GVAL                        877
#define T3GGO_nDONE                   878
#define T3GSPM                        879
#define T3GTM                         880
#define T3GPOL                        881
#define TMR3GE                        882
#define TMR4                          883
#define PR4                           884
#define T4CON                         885
#define T4CKPS0                       886
#define T4CKPS                        887
#define T4CKPS1                       888
#define TMR4ON                        889
#define T4OUTPS                       890
#define T4OUTPS0                      891
#define T4OUTPS1                      892
#define T4OUTPS2                      893
#define T4OUTPS3                      894
#define TMR5L                         895
#define TMR5H                         896
#define T5CON                         897
#define TMR5ON                        898
#define T5SYNC                        899
#define T5SOSC                        900
#define T5CKPS                        901
#define T5CKPS0                       902
#define T5CKPS1                       903
#define TMR5CS0                       904
#define TMR5CS                        905
#define TMR5CS1                       906
#define T5GCON                        907
#define T5GSS                         908
#define T5GSS0                        909
#define T5GSS1                        910
#define T5GVAL                        911
#define T5GGO_nDONE                   912
#define T5GSPM                        913
#define T5GTM                         914
#define T5GPOL                        915
#define TMR5GE                        916
#define TMR6                          917
#define PR6                           918
#define T6CON                         919
#define T6CKPS0                       920
#define T6CKPS                        921
#define T6CKPS1                       922
#define TMR6ON                        923
#define T6OUTPS0                      924
#define T6OUTPS                       925
#define T6OUTPS1                      926
#define T6OUTPS2                      927
#define T6OUTPS3                      928
#define CCDCON                        929
#define CCDS                          930
#define CCDS0                         931
#define CCDS1                         932
#define CCDEN                         933
#define CCDPA                         934
#define CCDPA0                        935
#define CCDPA1                        936
#define CCDPA2                        937
#define CCDPA4                        938
#define CCDPA5                        939
#define CCDPB                         940
#define CCDPB4                        941
#define CCDPB5                        942
#define CCDPB6                        943
#define CCDPB7                        944
#define CCDPC                         945
#define CCDPC0                        946
#define CCDPC1                        947
#define CCDPC2                        948
#define CCDPC3                        949
#define CCDPC4                        950
#define CCDPC5                        951
#define CCDPC6                        952
#define CCDPC7                        953
#define NCO1ACCL                      954
#define NCO1ACCL_NCO1ACC              955
#define NCO1ACCH                      956
#define NCO1ACCH_NCO1ACC              957
#define NCO1ACCU                      958
#define NCO1ACCU_NCO1ACC              959
#define NCO1INCL                      960
#define NCO1INCL_NCO1INC              961
#define NCO1INCH                      962
#define NCO1INCH_NCO1INC              963
#define NCO1INCU                      964
#define NCO1INCU_NCO1INC              965
#define NCO1CON                       966
#define N1PFM                         967
#define N1POL                         968
#define N1OUT                         969
#define N1EN                          970
#define NCO1CLK                       971
#define N1CKS                         972
#define N1PWS                         973
#define PWM5DCL                       974
#define PWM5DCL0                      975
#define PWM5DCL1                      976
#define PWM5DCH                       977
#define PWM5DCH0                      978
#define PWM5DCH1                      979
#define PWM5DCH2                      980
#define PWM5DCH3                      981
#define PWM5DCH4                      982
#define PWM5DCH5                      983
#define PWM5DCH6                      984
#define PWM5DCH7                      985
#define PWM5CON                       986
#define PWM5POL                       987
#define PWM5OUT                       988
#define PWM5EN                        989
#define PWM6DCL                       990
#define PWM6DCL0                      991
#define PWM6DCL1                      992
#define PWM6DCH                       993
#define PWM6DCH0                      994
#define PWM6DCH1                      995
#define PWM6DCH2                      996
#define PWM6DCH3                      997
#define PWM6DCH4                      998
#define PWM6DCH5                      999
#define PWM6DCH6                      1000
#define PWM6DCH7                      1001
#define PWM6CON                       1002
#define PWM6POL                       1003
#define PWM6OUT                       1004
#define PWM6EN                        1005
#define PWMTMRS                       1006
#define P5TSEL                        1007
#define P5TSEL0                       1008
#define P5TSEL1                       1009
#define P6TSEL0                       1010
#define P6TSEL                        1011
#define P6TSEL1                       1012
#define CWG1CLKCON                    1013
#define CWG1CLKCON_CS                 1014
#define CWG1CS                        1015
#define CWG1DAT                       1016
#define CWG1DAT_DAT                   1017
#define CWG1DAT0                      1018
#define CWG1DAT1                      1019
#define CWG1DAT2                      1020
#define CWG1DAT3                      1021
#define CWG1DBR_DBR                   1022
#define CWG1DBR0                      1023
#define CWG1DBR_DBR0                  1024
#define CWG1DBR                       1025
#define CWG1DBR1                      1026
#define CWG1DBR_DBR1                  1027
#define CWG1DBR2                      1028
#define CWG1DBR_DBR2                  1029
#define CWG1DBR3                      1030
#define CWG1DBR_DBR3                  1031
#define CWG1DBR_DBR4                  1032
#define CWG1DBR4                      1033
#define CWG1DBR5                      1034
#define CWG1DBR_DBR5                  1035
#define CWG1DBF                       1036
#define CWG1DBF0                      1037
#define CWG1DBF_DBF                   1038
#define CWG1DBF_DBF0                  1039
#define CWG1DBF1                      1040
#define CWG1DBF_DBF1                  1041
#define CWG1DBF_DBF2                  1042
#define CWG1DBF2                      1043
#define CWG1DBF3                      1044
#define CWG1DBF_DBF3                  1045
#define CWG1DBF_DBF4                  1046
#define CWG1DBF4                      1047
#define CWG1DBF_DBF5                  1048
#define CWG1DBF5                      1049
#define CWG1CON0                      1050
#define CWG1MODE0                     1051
#define CWG1CON0_MODE                 1052
#define CWG1CON0_MODE0                1053
#define CWG1MODE                      1054
#define CWG1MODE1                     1055
#define CWG1CON0_MODE1                1056
#define CWG1MODE2                     1057
#define CWG1CON0_MODE2                1058
#define CWG1CON0_LD                   1059
#define CWG1LD                        1060
#define CWG1EN                        1061
#define G1EN                          1062
#define CWG1CON0_EN                   1063
#define CWG1CON1                      1064
#define CWG1POLA                      1065
#define CWG1CON1_POLA                 1066
#define CWG1CON1_POLB                 1067
#define CWG1POLB                      1068
#define CWG1POLC                      1069
#define CWG1CON1_POLC                 1070
#define CWG1CON1_POLD                 1071
#define CWG1POLD                      1072
#define CWG1CON1_IN                   1073
#define CWG1IN                        1074
#define CWG1AS0                       1075
#define CWG1LSAC                      1076
#define CWG1AS0_LSAC0                 1077
#define CWG1AS0_LSAC                  1078
#define CWG1LSAC0                     1079
#define CWG1AS0_LSAC1                 1080
#define CWG1LSAC1                     1081
#define CWG1AS0_LSBD0                 1082
#define CWG1LSBD0                     1083
#define CWG1LSBD                      1084
#define CWG1AS0_LSBD                  1085
#define CWG1LSBD1                     1086
#define CWG1AS0_LSBD1                 1087
#define CWG1AS0_REN                   1088
#define CWG1REN                       1089
#define CWG1AS0_SHUTDOWN              1090
