tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18345_tdd.h
#define CWG1SHUTDOWN                  1091
#define CWG1AS1                       1092
#define CWG1AS1_AS0E                  1093
#define CWG1AS1_AS1E                  1094
#define CWG1AS1_AS2E                  1095
#define CWG1AS1_AS3E                  1096
#define CWG1AS1_AS4E                  1097
#define CWG1STR                       1098
#define CWG1STRA                      1099
#define CWG1STR_STRA                  1100
#define CWG1STRB                      1101
#define CWG1STR_STRB                  1102
#define CWG1STRC                      1103
#define CWG1STR_STRC                  1104
#define CWG1STR_STRD                  1105
#define CWG1STRD                      1106
#define CWG1OVRA                      1107
#define CWG1STR_OVRA                  1108
#define CWG1OVRB                      1109
#define CWG1STR_OVRB                  1110
#define CWG1OVRC                      1111
#define CWG1STR_OVRC                  1112
#define CWG1OVRD                      1113
#define CWG1STR_OVRD                  1114
#define CWG2CLKCON                    1115
#define CWG2CS                        1116
#define CWG2CLKCON_CS                 1117
#define CWG2DAT                       1118
#define CWG2DAT0                      1119
#define CWG2DAT_DAT                   1120
#define CWG2DAT1                      1121
#define CWG2DAT2                      1122
#define CWG2DAT3                      1123
#define CWG2DBR_DBR                   1124
#define CWG2DBR_DBR0                  1125
#define CWG2DBR                       1126
#define CWG2DBR0                      1127
#define CWG2DBR_DBR1                  1128
#define CWG2DBR1                      1129
#define CWG2DBR_DBR2                  1130
#define CWG2DBR2                      1131
#define CWG2DBR_DBR3                  1132
#define CWG2DBR3                      1133
#define CWG2DBR_DBR4                  1134
#define CWG2DBR4                      1135
#define CWG2DBR_DBR5                  1136
#define CWG2DBR5                      1137
#define CWG2DBF                       1138
#define CWG2DBF_DBF0                  1139
#define CWG2DBF_DBF                   1140
#define CWG2DBF0                      1141
#define CWG2DBF_DBF1                  1142
#define CWG2DBF1                      1143
#define CWG2DBF_DBF2                  1144
#define CWG2DBF2                      1145
#define CWG2DBF_DBF3                  1146
#define CWG2DBF3                      1147
#define CWG2DBF_DBF4                  1148
#define CWG2DBF4                      1149
#define CWG2DBF5                      1150
#define CWG2DBF_DBF5                  1151
#define CWG2CON0                      1152
#define CWG2MODE                      1153
#define CWG2MODE0                     1154
#define CWG2CON0_MODE                 1155
#define CWG2CON0_MODE0                1156
#define CWG2MODE1                     1157
#define CWG2CON0_MODE1                1158
#define CWG2MODE2                     1159
#define CWG2CON0_MODE2                1160
#define CWG2LD                        1161
#define CWG2CON0_LD                   1162
#define CWG2CON0_EN                   1163
#define CWG2EN                        1164
#define G2EN                          1165
#define CWG2CON1                      1166
#define CWG2POLA                      1167
#define CWG2CON1_POLA                 1168
#define CWG2POLB                      1169
#define CWG2CON1_POLB                 1170
#define CWG2POLC                      1171
#define CWG2CON1_POLC                 1172
#define CWG2CON1_POLD                 1173
#define CWG2POLD                      1174
#define CWG2IN                        1175
#define CWG2CON1_IN                   1176
#define CWG2AS0                       1177
#define CWG2LSAC                      1178
#define CWG2AS0_LSAC                  1179
#define CWG2LSAC0                     1180
#define CWG2AS0_LSAC0                 1181
#define CWG2LSAC1                     1182
#define CWG2AS0_LSAC1                 1183
#define CWG2AS0_LSBD0                 1184
#define CWG2LSBD                      1185
#define CWG2AS0_LSBD                  1186
#define CWG2LSBD0                     1187
#define CWG2AS0_LSBD1                 1188
#define CWG2LSBD1                     1189
#define CWG2AS0_REN                   1190
#define CWG2REN                       1191
#define CWG2AS0_SHUTDOWN              1192
#define CWG2SHUTDOWN                  1193
#define CWG2AS1                       1194
#define CWG2AS1_AS0E                  1195
#define CWG2AS1_AS1E                  1196
#define CWG2AS1_AS2E                  1197
#define CWG2AS1_AS3E                  1198
#define CWG2AS1_AS4E                  1199
#define CWG2STR                       1200
#define CWG2STR_STRA                  1201
#define CWG2STRA                      1202
#define CWG2STR_STRB                  1203
#define CWG2STRB                      1204
#define CWG2STR_STRC                  1205
#define CWG2STRC                      1206
#define CWG2STR_STRD                  1207
#define CWG2STRD                      1208
#define CWG2STR_OVRA                  1209
#define CWG2OVRA                      1210
#define CWG2OVRB                      1211
#define CWG2STR_OVRB                  1212
#define CWG2STR_OVRC                  1213
#define CWG2OVRC                      1214
#define CWG2OVRD                      1215
#define CWG2STR_OVRD                  1216
#define NVMADR0                       1217
#define NVMADRL                       1218
#define NVMADR1                       1219
#define NVMADR2                       1220
#define NVMADR3                       1221
#define NVMADR4                       1222
#define NVMADR5                       1223
#define NVMADR6                       1224
#define NVMADR7                       1225
#define NVMADR8                       1226
#define NVMADRH                       1227
#define NVMADR9                       1228
#define NVMADR10                      1229
#define NVMADR11                      1230
#define NVMADR12                      1231
#define NVMADR13                      1232
#define NVMADR14                      1233
#define NVMDAT0                       1234
#define NVMDATL                       1235
#define NVMDAT1                       1236
#define NVMDAT2                       1237
#define NVMDAT3                       1238
#define NVMDAT4                       1239
#define NVMDAT5                       1240
#define NVMDAT6                       1241
#define NVMDAT7                       1242
#define NVMDAT8                       1243
#define NVMDATH                       1244
#define NVMDAT9                       1245
#define NVMDAT10                      1246
#define NVMDAT11                      1247
#define NVMDAT12                      1248
#define NVMDAT13                      1249
#define NVMCON1                       1250
#define RD                            1251
#define WR                            1252
#define WREN                          1253
#define WRERR                         1254
#define FREE                          1255
#define LWLO                          1256
#define NVMREGS                       1257
#define NVMCON2                       1258
#define NMVCON2                       1259
#define PCON0                         1260
#define nBOR                          1261
#define nPOR                          1262
#define nRI                           1263
#define nRMCLR                        1264
#define nRWDT                         1265
#define STKUNF                        1266
#define STKOVF                        1267
#define PMD0                          1268
#define IOCMD                         1269
#define CLKRMD                        1270
#define NVMMD                         1271
#define FVRMD                         1272
#define SYSCMD                        1273
#define PMD1                          1274
#define TMR0MD                        1275
#define TMR1MD                        1276
#define TMR2MD                        1277
#define TMR3MD                        1278
#define TMR4MD                        1279
#define TMR5MD                        1280
#define TMR6MD                        1281
#define NCOMD                         1282
#define PMD2                          1283
#define CMP1MD                        1284
#define CMP2MD                        1285
#define ADCMD                         1286
#define DACMD                         1287
#define PMD3                          1288
#define CCP1MD                        1289
#define CCP2MD                        1290
#define CCP3MD                        1291
#define CCP4MD                        1292
#define PWM5MD                        1293
#define PWM6MD                        1294
#define CWG1MD                        1295
#define CWG2MD                        1296
#define PMD4                          1297
#define MSSP1MD                       1298
#define MSSP2MD                       1299
#define UART1MD                       1300
#define PMD5                          1301
#define DSMMD                         1302
#define CLC1MD                        1303
#define CLC2MD                        1304
#define CLC3MD                        1305
#define CLC4MD                        1306
#define CPUDOZE                       1307
#define DOZE0                         1308
#define DOZE                          1309
#define DOZE1                         1310
#define DOZE2                         1311
#define DOE                           1312
#define ROI                           1313
#define DOZEN                         1314
#define IDLEN                         1315
#define OSCCON1                       1316
#define NDIV0                         1317
#define NDIV                          1318
#define NDIV1                         1319
#define NDIV2                         1320
#define NDIV3                         1321
#define NOSC0                         1322
#define NOSC                          1323
#define NOSC1                         1324
#define NOSC2                         1325
#define OSCCON2                       1326
#define CDIV0                         1327
#define CDIV                          1328
#define CDIV1                         1329
#define CDIV2                         1330
#define CDIV3                         1331
#define COSC                          1332
#define COSC0                         1333
#define COSC1                         1334
#define COSC2                         1335
#define OSCCON3                       1336
#define NOSCR                         1337
#define ORDY                          1338
#define SOSCBE                        1339
#define SOSCPWR                       1340
#define CSWHOLD                       1341
#define OSCSTAT1                      1342
#define PLLR                          1343
#define ADOR                          1344
#define SOR                           1345
#define LFOR                          1346
#define HFOR                          1347
#define EXTOR                         1348
#define OSCEN                         1349
#define ADOEN                         1350
#define SOSCEN                        1351
#define LFOEN                         1352
#define HFOEN                         1353
#define EXTOEN                        1354
#define OSCTUNE                       1355
#define HFTUN0                        1356
#define HFTUN                         1357
#define HFTUN1                        1358
#define HFTUN2                        1359
#define HFTUN3                        1360
#define HFTUN4                        1361
#define HFTUN5                        1362
#define OSCFRQ                        1363
#define HFFRQ                         1364
#define HFFRQ0                        1365
#define HFFRQ1                        1366
#define HFFRQ2                        1367
#define HFFRQ3                        1368
#define PPSLOCK                       1369
#define PPSLOCKED                     1370
#define INTPPS0                       1371
#define INTPPS                        1372
#define INTPPS1                       1373
#define INTPPS2                       1374
#define INTPPS3                       1375
#define INTPPS4                       1376
#define T0CKIPPS0                     1377
#define T0CKIPPS                      1378
#define T0CKIPPS1                     1379
#define T0CKIPPS2                     1380
#define T0CKIPPS3                     1381
#define T0CKIPPS4                     1382
#define T1CKIPPS0                     1383
#define T1CKIPPS                      1384
#define T1CKIPPS1                     1385
#define T1CKIPPS2                     1386
#define T1CKIPPS3                     1387
#define T1CKIPPS4                     1388
#define T1GPPS0                       1389
#define T1GPPS                        1390
#define T1GPPS1                       1391
#define T1GPPS2                       1392
#define T1GPPS3                       1393
#define T1GPPS4                       1394
#define CCP1PPS0                      1395
#define CCP1PPS                       1396
#define CCP1PPS1                      1397
#define CCP1PPS2                      1398
#define CCP1PPS3                      1399
#define CCP1PPS4                      1400
#define CCP2PPS0                      1401
#define CCP2PPS                       1402
#define CCP2PPS1                      1403
#define CCP2PPS2                      1404
#define CCP2PPS3                      1405
#define CCP2PPS4                      1406
#define CCP3PPS0                      1407
#define CCP3PPS                       1408
#define CCP3PPS1                      1409
#define CCP3PPS2                      1410
#define CCP3PPS3                      1411
#define CCP3PPS4                      1412
#define CCP4PPS0                      1413
#define CCP4PPS                       1414
#define CCP4PPS1                      1415
#define CCP4PPS2                      1416
#define CCP4PPS3                      1417
#define CCP4PPS4                      1418
#define CWG1PPS0                      1419
#define CWG1PPS                       1420
#define CWG1PPS1                      1421
#define CWG1PPS2                      1422
#define CWG1PPS3                      1423
#define CWG1PPS4                      1424
#define CWG2PPS0                      1425
#define CWG2PPS                       1426
#define CWG2PPS1                      1427
#define CWG2PPS2                      1428
#define CWG2PPS3                      1429
#define CWG2PPS4                      1430
#define MDCIN1PPS                     1431
#define MDCIN1PPS0                    1432
#define MDCIN1PPS1                    1433
#define MDCIN1PPS2                    1434
#define MDCIN1PPS3                    1435
#define MDCIN1PPS4                    1436
#define MDCIN2PPS0                    1437
#define MDCIN2PPS                     1438
#define MDCIN2PPS1                    1439
#define MDCIN2PPS2                    1440
#define MDCIN2PPS3                    1441
#define MDCIN2PPS4                    1442
#define MDMINPPS                      1443
#define MDMINPPS0                     1444
#define MDMINPPS1                     1445
#define MDMINPPS2                     1446
#define MDMINPPS3                     1447
#define MDMINPPS4                     1448
#define SSP2CLKPPS                    1449
#define SSP2CLKPPS0                   1450
#define SSP2CLKPPS1                   1451
#define SSP2CLKPPS2                   1452
#define SSP2CLKPPS3                   1453
#define SSP2CLKPPS4                   1454
#define SSP2DATPPS                    1455
#define SSP2DATPPS0                   1456
#define SSP2DATPPS1                   1457
#define SSP2DATPPS2                   1458
#define SSP2DATPPS3                   1459
#define SSP2DATPPS4                   1460
#define SSP2SSPPS                     1461
#define SSP2SSPPS0                    1462
#define SSP2SSPPS1                    1463
#define SSP2SSPPS2                    1464
#define SSP2SSPPS3                    1465
#define SSP2SSPPS4                    1466
#define SSP1CLKPPS0                   1467
#define SSP1CLKPPS                    1468
#define SSP1CLKPPS1                   1469
#define SSP1CLKPPS2                   1470
#define SSP1CLKPPS3                   1471
#define SSP1CLKPPS4                   1472
#define SSP1DATPPS0                   1473
#define SSP1DATPPS                    1474
#define SSP1DATPPS1                   1475
#define SSP1DATPPS2                   1476
#define SSP1DATPPS3                   1477
#define SSP1DATPPS4                   1478
#define SSP1SSPPS                     1479
#define SSP1SSPPS0                    1480
#define SSP1SSPPS1                    1481
#define SSP1SSPPS2                    1482
#define SSP1SSPPS3                    1483
#define SSP1SSPPS4                    1484
#define RXPPS                         1485
#define RXDTPPS0                      1486
#define RXDTPPS1                      1487
#define RXDTPPS2                      1488
#define RXDTPPS3                      1489
#define RXDTPPS4                      1490
#define TXCKPPS0                      1491
#define TXPPS                         1492
#define TXCKPPS1                      1493
#define TXCKPPS2                      1494
#define TXCKPPS3                      1495
#define TXCKPPS4                      1496
#define CLCIN0PPS                     1497
#define CLCIN0PPS0                    1498
#define CLCIN0PPS1                    1499
#define CLCIN0PPS2                    1500
#define CLCIN0PPS3                    1501
#define CLCIN0PPS4                    1502
#define CLCIN1PPS0                    1503
#define CLCIN1PPS                     1504
#define CLCIN1PPS1                    1505
#define CLCIN1PPS2                    1506
#define CLCIN1PPS3                    1507
#define CLCIN1PPS4                    1508
#define CLCIN2PPS                     1509
#define CLCIN2PPS0                    1510
#define CLCIN2PPS1                    1511
#define CLCIN2PPS2                    1512
#define CLCIN2PPS3                    1513
#define CLCIN2PPS4                    1514
#define CLCIN3PPS                     1515
#define CLCIN3PPS0                    1516
#define CLCIN3PPS1                    1517
#define CLCIN3PPS2                    1518
#define CLCIN3PPS3                    1519
#define CLCIN3PPS4                    1520
#define T3CKIPPS                      1521
#define T3GPPS                        1522
#define T5CKIPPS                      1523
#define T5GPPS                        1524
#define RA0PPS                        1525
#define RA0PPS0                       1526
#define RA0PPS1                       1527
#define RA0PPS2                       1528
#define RA0PPS3                       1529
#define RA0PPS4                       1530
#define RA1PPS                        1531
#define RA1PPS0                       1532
#define RA1PPS1                       1533
#define RA1PPS2                       1534
#define RA1PPS3                       1535
#define RA1PPS4                       1536
#define RA2PPS0                       1537
#define RA2PPS                        1538
#define RA2PPS1                       1539
#define RA2PPS2                       1540
#define RA2PPS3                       1541
#define RA2PPS4                       1542
#define RA4PPS                        1543
#define RA4PPS0                       1544
#define RA4PPS1                       1545
#define RA4PPS2                       1546
#define RA4PPS3                       1547
#define RA4PPS4                       1548
#define RA5PPS                        1549
#define RA5PPS0                       1550
#define RA5PPS1                       1551
#define RA5PPS2                       1552
#define RA5PPS3                       1553
#define RA5PPS4                       1554
#define RB4PPS                        1555
#define RB4PPS0                       1556
#define RB4PPS1                       1557
#define RB4PPS2                       1558
#define RB4PPS3                       1559
#define RB4PPS4                       1560
#define RB5PPS                        1561
#define RB5PPS0                       1562
#define RB5PPS1                       1563
#define RB5PPS2                       1564
#define RB5PPS3                       1565
#define RB5PPS4                       1566
#define RB6PPS0                       1567
#define RB6PPS                        1568
#define RB6PPS1                       1569
#define RB6PPS2                       1570
#define RB6PPS3                       1571
#define RB6PPS4                       1572
#define RB7PPS0                       1573
#define RB7PPS                        1574
#define RB7PPS1                       1575
#define RB7PPS2                       1576
#define RB7PPS3                       1577
#define RB7PPS4                       1578
#define RC0PPS                        1579
#define RC0PPS0                       1580
#define RC0PPS1                       1581
#define RC0PPS2                       1582
#define RC0PPS3                       1583
#define RC0PPS4                       1584
#define RC1PPS0                       1585
#define RC1PPS                        1586
#define RC1PPS1                       1587
#define RC1PPS2                       1588
#define RC1PPS3                       1589
#define RC1PPS4                       1590
#define RC2PPS                        1591
#define RC2PPS0                       1592
#define RC2PPS1                       1593
#define RC2PPS2                       1594
#define RC2PPS3                       1595
#define RC2PPS4                       1596
#define RC3PPS                        1597
#define RC3PPS0                       1598
#define RC3PPS1                       1599
#define RC3PPS2                       1600
#define RC3PPS3                       1601
#define RC3PPS4                       1602
#define RC4PPS0                       1603
#define RC4PPS                        1604
#define RC4PPS1                       1605
#define RC4PPS2                       1606
#define RC4PPS3                       1607
#define RC4PPS4                       1608
#define RC5PPS0                       1609
#define RC5PPS                        1610
#define RC5PPS1                       1611
#define RC5PPS2                       1612
#define RC5PPS3                       1613
#define RC5PPS4                       1614
#define RC6PPS                        1615
#define RC6PPS0                       1616
#define RC6PPS1                       1617
#define RC6PPS2                       1618
#define RC6PPS3                       1619
#define RC6PPS4                       1620
#define RC7PPS                        1621
#define RC7PPS0                       1622
#define RC7PPS1                       1623
#define RC7PPS2                       1624
#define RC7PPS3                       1625
#define RC7PPS4                       1626
#define CLCDATA                       1627
#define MLC1OUT                       1628
#define MLC2OUT                       1629
#define MLC3OUT                       1630
#define MLC4OUT                       1631
#define CLC1CON                       1632
#define CLC1CON_MODE0                 1633
#define LC1MODE                       1634
#define CLC1CON_MODE                  1635
#define LC1MODE0                      1636
#define CLC1CON_MODE1                 1637
#define LC1MODE1                      1638
#define LC1MODE2                      1639
#define CLC1CON_MODE2                 1640
#define LC1INTN                       1641
#define CLC1CON_INTN                  1642
#define CLC1CON_INTP                  1643
#define LC1INTP                       1644
#define LC1OUT                        1645
#define CLC1CON_OUT                   1646
#define CLC1CON_EN                    1647
#define LC1EN                         1648
