tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18345_tdd.h
#define CLC1POL                       1649
#define LC1G1POL                      1650
#define CLC1POL_G1POL                 1651
#define CLC1POL_G2POL                 1652
#define LC1G2POL                      1653
#define LC1G3POL                      1654
#define CLC1POL_G3POL                 1655
#define LC1G4POL                      1656
#define CLC1POL_G4POL                 1657
#define CLC1POL_POL                   1658
#define LC1POL                        1659
#define CLC1SEL0                      1660
#define CLC1SEL0_D1S0                 1661
#define LC1D1S0                       1662
#define CLC1SEL0_D1S                  1663
#define LC1D1S                        1664
#define CLC1SEL0_D1S1                 1665
#define LC1D1S1                       1666
#define CLC1SEL0_D1S2                 1667
#define LC1D1S2                       1668
#define LC1D1S3                       1669
#define CLC1SEL0_D1S3                 1670
#define CLC1SEL0_D1S4                 1671
#define LC1D1S4                       1672
#define CLC1SEL0_D1S5                 1673
#define LC1D1S5                       1674
#define CLC1SEL1                      1675
#define CLC1SEL1_D2S0                 1676
#define CLC1SEL1_D2S                  1677
#define LC1D2S                        1678
#define LC1D2S0                       1679
#define CLC1SEL1_D2S1                 1680
#define LC1D2S1                       1681
#define CLC1SEL1_D2S2                 1682
#define LC1D2S2                       1683
#define LC1D2S3                       1684
#define CLC1SEL1_D2S3                 1685
#define LC1D2S4                       1686
#define CLC1SEL1_D2S4                 1687
#define LC1D2S5                       1688
#define CLC1SEL1_D2S5                 1689
#define CLC1SEL2                      1690
#define LC1D3S0                       1691
#define CLC1SEL2_D3S                  1692
#define LC1D3S                        1693
#define CLC1SEL2_D3S0                 1694
#define LC1D3S1                       1695
#define CLC1SEL2_D3S1                 1696
#define LC1D3S2                       1697
#define CLC1SEL2_D3S2                 1698
#define LC1D3S3                       1699
#define CLC1SEL2_D3S3                 1700
#define LC1D3S4                       1701
#define CLC1SEL2_D3S4                 1702
#define LC1D3S5                       1703
#define CLC1SEL2_D3S5                 1704
#define CLC1SEL3                      1705
#define CLC1SEL3_D4S                  1706
#define LC1D4S                        1707
#define LC1D4S0                       1708
#define CLC1SEL3_D4S0                 1709
#define CLC1SEL3_D4S1                 1710
#define LC1D4S1                       1711
#define LC1D4S2                       1712
#define CLC1SEL3_D4S2                 1713
#define LC1D4S3                       1714
#define CLC1SEL3_D4S3                 1715
#define LC1D4S4                       1716
#define CLC1SEL3_D4S4                 1717
#define LC1D4S5                       1718
#define CLC1SEL3_D4S5                 1719
#define CLC1GLS0                      1720
#define CLC1GLS0_D1N                  1721
#define LC1G1D1N                      1722
#define CLC1GLS0_D1T                  1723
#define LC1G1D1T                      1724
#define LC1G1D2N                      1725
#define CLC1GLS0_D2N                  1726
#define LC1G1D2T                      1727
#define CLC1GLS0_D2T                  1728
#define CLC1GLS0_D3N                  1729
#define LC1G1D3N                      1730
#define CLC1GLS0_D3T                  1731
#define LC1G1D3T                      1732
#define CLC1GLS0_D4N                  1733
#define LC1G1D4N                      1734
#define CLC1GLS0_D4T                  1735
#define LC1G1D4T                      1736
#define CLC1GLS1                      1737
#define CLC1GLS1_D1N                  1738
#define LC1G2D1N                      1739
#define LC1G2D1T                      1740
#define CLC1GLS1_D1T                  1741
#define CLC1GLS1_D2N                  1742
#define LC1G2D2N                      1743
#define LC1G2D2T                      1744
#define CLC1GLS1_D2T                  1745
#define CLC1GLS1_D3N                  1746
#define LC1G2D3N                      1747
#define LC1G2D3T                      1748
#define CLC1GLS1_D3T                  1749
#define CLC1GLS1_D4N                  1750
#define LC1G2D4N                      1751
#define LC1G2D4T                      1752
#define CLC1GLS1_D4T                  1753
#define CLC1GLS2                      1754
#define CLC1GLS2_D1N                  1755
#define LC1G3D1N                      1756
#define LC1G3D1T                      1757
#define CLC1GLS2_D1T                  1758
#define LC1G3D2N                      1759
#define CLC1GLS2_D2N                  1760
#define LC1G3D2T                      1761
#define CLC1GLS2_D2T                  1762
#define CLC1GLS2_D3N                  1763
#define LC1G3D3N                      1764
#define LC1G3D3T                      1765
#define CLC1GLS2_D3T                  1766
#define LC1G3D4N                      1767
#define CLC1GLS2_D4N                  1768
#define LC1G3D4T                      1769
#define CLC1GLS2_D4T                  1770
#define CLC1GLS3                      1771
#define LC1G4D1N                      1772
#define CLC1GLS3_G4D1N                1773
#define LC1G4D1T                      1774
#define CLC1GLS3_G4D1T                1775
#define CLC1GLS3_G4D2N                1776
#define LC1G4D2N                      1777
#define CLC1GLS3_G4D2T                1778
#define LC1G4D2T                      1779
#define LC1G4D3N                      1780
#define CLC1GLS3_G4D3N                1781
#define LC1G4D3T                      1782
#define CLC1GLS3_G4D3T                1783
#define CLC1GLS3_G4D4N                1784
#define LC1G4D4N                      1785
#define CLC1GLS3_G4D4T                1786
#define LC1G4D4T                      1787
#define CLC2CON                       1788
#define LC2MODE0                      1789
#define CLC2CON_MODE                  1790
#define LC2MODE                       1791
#define CLC2CON_MODE0                 1792
#define LC2MODE1                      1793
#define CLC2CON_MODE1                 1794
#define LC2MODE2                      1795
#define CLC2CON_MODE2                 1796
#define LC2INTN                       1797
#define CLC2CON_INTN                  1798
#define LC2INTP                       1799
#define CLC2CON_INTP                  1800
#define CLC2CON_OUT                   1801
#define LC2OUT                        1802
#define CLC2CON_EN                    1803
#define LC2EN                         1804
#define CLC2POL                       1805
#define LC2G1POL                      1806
#define CLC2POL_G1POL                 1807
#define LC2G2POL                      1808
#define CLC2POL_G2POL                 1809
#define LC2G3POL                      1810
#define CLC2POL_G3POL                 1811
#define LC2G4POL                      1812
#define CLC2POL_G4POL                 1813
#define CLC2POL_POL                   1814
#define LC2POL                        1815
#define CLC2SEL0                      1816
#define CLC2SEL0_D1S                  1817
#define LC2D1S0                       1818
#define CLC2SEL0_D1S0                 1819
#define LC2D1S                        1820
#define LC2D1S1                       1821
#define CLC2SEL0_D1S1                 1822
#define LC2D1S2                       1823
#define CLC2SEL0_D1S2                 1824
#define CLC2SEL0_D1S3                 1825
#define LC2D1S3                       1826
#define LC2D1S4                       1827
#define CLC2SEL0_D1S4                 1828
#define LC2D1S5                       1829
#define CLC2SEL0_D1S5                 1830
#define CLC2SEL1                      1831
#define LC2D2S0                       1832
#define CLC2SEL1_D2S0                 1833
#define LC2D2S                        1834
#define CLC2SEL1_D2S                  1835
#define LC2D2S1                       1836
#define CLC2SEL1_D2S1                 1837
#define LC2D2S2                       1838
#define CLC2SEL1_D2S2                 1839
#define LC2D2S3                       1840
#define CLC2SEL1_D2S3                 1841
#define LC2D2S4                       1842
#define CLC2SEL1_D2S4                 1843
#define LC2D2S5                       1844
#define CLC2SEL1_D2S5                 1845
#define CLC2SEL2                      1846
#define CLC2SEL2_D3S                  1847
#define LC2D3S0                       1848
#define CLC2SEL2_D3S0                 1849
#define LC2D3S                        1850
#define CLC2SEL2_D3S1                 1851
#define LC2D3S1                       1852
#define LC2D3S2                       1853
#define CLC2SEL2_D3S2                 1854
#define LC2D3S3                       1855
#define CLC2SEL2_D3S3                 1856
#define LC2D3S4                       1857
#define CLC2SEL2_D3S4                 1858
#define LC2D3S5                       1859
#define CLC2SEL2_D3S5                 1860
#define CLC2SEL3                      1861
#define LC2D4S0                       1862
#define CLC2SEL3_D4S                  1863
#define CLC2SEL3_D4S0                 1864
#define LC2D4S                        1865
#define LC2D4S1                       1866
#define CLC2SEL3_D4S1                 1867
#define LC2D4S2                       1868
#define CLC2SEL3_D4S2                 1869
#define CLC2SEL3_D4S3                 1870
#define LC2D4S3                       1871
#define LC2D4S4                       1872
#define CLC2SEL3_D4S4                 1873
#define LC2D4S5                       1874
#define CLC2SEL3_D4S5                 1875
#define CLC2GLS0                      1876
#define LC2G1D1N                      1877
#define CLC2GLS0_D1N                  1878
#define CLC2GLS0_D1T                  1879
#define LC2G1D1T                      1880
#define LC2G1D2N                      1881
#define CLC2GLS0_D2N                  1882
#define CLC2GLS0_D2T                  1883
#define LC2G1D2T                      1884
#define LC2G1D3N                      1885
#define CLC2GLS0_D3N                  1886
#define CLC2GLS0_D3T                  1887
#define LC2G1D3T                      1888
#define LC2G1D4N                      1889
#define CLC2GLS0_D4N                  1890
#define CLC2GLS0_D4T                  1891
#define LC2G1D4T                      1892
#define CLC2GLS1                      1893
#define CLC2GLS1_D1N                  1894
#define LC2G2D1N                      1895
#define CLC2GLS1_D1T                  1896
#define LC2G2D1T                      1897
#define CLC2GLS1_D2N                  1898
#define LC2G2D2N                      1899
#define CLC2GLS1_D2T                  1900
#define LC2G2D2T                      1901
#define LC2G2D3N                      1902
#define CLC2GLS1_D3N                  1903
#define LC2G2D3T                      1904
#define CLC2GLS1_D3T                  1905
#define LC2G2D4N                      1906
#define CLC2GLS1_D4N                  1907
#define LC2G2D4T                      1908
#define CLC2GLS1_D4T                  1909
#define CLC2GLS2                      1910
#define LC2G3D1N                      1911
#define CLC2GLS2_D1N                  1912
#define CLC2GLS2_D1T                  1913
#define LC2G3D1T                      1914
#define CLC2GLS2_D2N                  1915
#define LC2G3D2N                      1916
#define LC2G3D2T                      1917
#define CLC2GLS2_D2T                  1918
#define CLC2GLS2_D3N                  1919
#define LC2G3D3N                      1920
#define CLC2GLS2_D3T                  1921
#define LC2G3D3T                      1922
#define CLC2GLS2_D4N                  1923
#define LC2G3D4N                      1924
#define LC2G3D4T                      1925
#define CLC2GLS2_D4T                  1926
#define CLC2GLS3                      1927
#define LC2G4D1N                      1928
#define CLC2GLS3_G4D1N                1929
#define CLC2GLS3_G4D1T                1930
#define LC2G4D1T                      1931
#define CLC2GLS3_G4D2N                1932
#define LC2G4D2N                      1933
#define LC2G4D2T                      1934
#define CLC2GLS3_G4D2T                1935
#define CLC2GLS3_G4D3N                1936
#define LC2G4D3N                      1937
#define CLC2GLS3_G4D3T                1938
#define LC2G4D3T                      1939
#define LC2G4D4N                      1940
#define CLC2GLS3_G4D4N                1941
#define CLC2GLS3_G4D4T                1942
#define LC2G4D4T                      1943
#define CLC3CON                       1944
#define LC3MODE                       1945
#define CLC3CON_MODE0                 1946
#define LC3MODE0                      1947
#define CLC3CON_MODE                  1948
#define CLC3CON_MODE1                 1949
#define LC3MODE1                      1950
#define CLC3CON_MODE2                 1951
#define LC3MODE2                      1952
#define LC3INTN                       1953
#define CLC3CON_INTN                  1954
#define LC3INTP                       1955
#define CLC3CON_INTP                  1956
#define LC3OUT                        1957
#define CLC3CON_OUT                   1958
#define LC3EN                         1959
#define CLC3CON_EN                    1960
#define CLC3POL                       1961
#define LC3G1POL                      1962
#define CLC3POL_G1POL                 1963
#define LC3G2POL                      1964
#define CLC3POL_G2POL                 1965
#define CLC3POL_G3POL                 1966
#define LC3G3POL                      1967
#define LC3G4POL                      1968
#define CLC3POL_G4POL                 1969
#define LC3POL                        1970
#define CLC3POL_POL                   1971
#define CLC3SEL0                      1972
#define CLC3SEL0_D1S0                 1973
#define LC3D1S0                       1974
#define CLC3SEL0_D1S                  1975
#define LC3D1S                        1976
#define LC3D1S1                       1977
#define CLC3SEL0_D1S1                 1978
#define LC3D1S2                       1979
#define CLC3SEL0_D1S2                 1980
#define LC3D1S3                       1981
#define CLC3SEL0_D1S3                 1982
#define LC3D1S4                       1983
#define CLC3SEL0_D1S4                 1984
#define LC3D1S5                       1985
#define CLC3SEL0_D1S5                 1986
#define CLC3SEL1                      1987
#define CLC3SEL1_D2S                  1988
#define CLC3SEL1_D2S0                 1989
#define LC3D2S                        1990
#define LC3D2S0                       1991
#define CLC3SEL1_D2S1                 1992
#define LC3D2S1                       1993
#define CLC3SEL1_D2S2                 1994
#define LC3D2S2                       1995
#define CLC3SEL1_D2S3                 1996
#define LC3D2S3                       1997
#define CLC3SEL1_D2S4                 1998
#define LC3D2S4                       1999
#define CLC3SEL1_D2S5                 2000
#define LC3D2S5                       2001
#define CLC3SEL2                      2002
#define LC3D3S                        2003
#define CLC3SEL2_D3S                  2004
#define LC3D3S0                       2005
#define CLC3SEL2_D3S0                 2006
#define LC3D3S1                       2007
#define CLC3SEL2_D3S1                 2008
#define LC3D3S2                       2009
#define CLC3SEL2_D3S2                 2010
#define LC3D3S3                       2011
#define CLC3SEL2_D3S3                 2012
#define CLC3SEL2_D3S4                 2013
#define LC3D3S4                       2014
#define CLC3SEL2_D3S5                 2015
#define LC3D3S5                       2016
#define CLC3SEL3                      2017
#define CLC3SEL3_D4S0                 2018
#define LC3D4S0                       2019
#define CLC3SEL3_D4S                  2020
#define LC3D4S                        2021
#define LC3D4S1                       2022
#define CLC3SEL3_D4S1                 2023
#define LC3D4S2                       2024
#define CLC3SEL3_D4S2                 2025
#define LC3D4S3                       2026
#define CLC3SEL3_D4S3                 2027
#define LC3D4S4                       2028
#define CLC3SEL3_D4S4                 2029
#define LC3D4S5                       2030
#define CLC3SEL3_D4S5                 2031
#define CLC3GLS0                      2032
#define CLC3GLS0_D1N                  2033
#define LC3G1D1N                      2034
#define LC3G1D1T                      2035
#define CLC3GLS0_D1T                  2036
#define LC3G1D2N                      2037
#define CLC3GLS0_D2N                  2038
#define CLC3GLS0_D2T                  2039
#define LC3G1D2T                      2040
#define CLC3GLS0_D3N                  2041
#define LC3G1D3N                      2042
#define LC3G1D3T                      2043
#define CLC3GLS0_D3T                  2044
#define CLC3GLS0_D4N                  2045
#define LC3G1D4N                      2046
#define CLC3GLS0_D4T                  2047
#define LC3G1D4T                      2048
#define CLC3GLS1                      2049
#define LC3G2D1N                      2050
#define CLC3GLS1_D1N                  2051
#define CLC3GLS1_D1T                  2052
#define LC3G2D1T                      2053
#define LC3G2D2N                      2054
#define CLC3GLS1_D2N                  2055
#define LC3G2D2T                      2056
#define CLC3GLS1_D2T                  2057
#define LC3G2D3N                      2058
#define CLC3GLS1_D3N                  2059
#define CLC3GLS1_D3T                  2060
#define LC3G2D3T                      2061
#define LC3G2D4N                      2062
#define CLC3GLS1_D4N                  2063
#define LC3G2D4T                      2064
#define CLC3GLS1_D4T                  2065
#define CLC3GLS2                      2066
#define LC3G3D1N                      2067
#define CLC3GLS2_D1N                  2068
#define LC3G3D1T                      2069
#define CLC3GLS2_D1T                  2070
#define CLC3GLS2_D2N                  2071
#define LC3G3D2N                      2072
#define CLC3GLS2_D2T                  2073
#define LC3G3D2T                      2074
#define CLC3GLS2_D3N                  2075
#define LC3G3D3N                      2076
#define LC3G3D3T                      2077
#define CLC3GLS2_D3T                  2078
#define CLC3GLS2_D4N                  2079
#define LC3G3D4N                      2080
#define CLC3GLS2_D4T                  2081
#define LC3G3D4T                      2082
#define CLC3GLS3                      2083
#define LC3G4D1N                      2084
#define CLC3GLS3_G4D1N                2085
#define LC3G4D1T                      2086
#define CLC3GLS3_G4D1T                2087
#define LC3G4D2N                      2088
#define CLC3GLS3_G4D2N                2089
#define CLC3GLS3_G4D2T                2090
#define LC3G4D2T                      2091
#define LC3G4D3N                      2092
#define CLC3GLS3_G4D3N                2093
#define CLC3GLS3_G4D3T                2094
#define LC3G4D3T                      2095
#define LC3G4D4N                      2096
#define CLC3GLS3_G4D4N                2097
#define LC3G4D4T                      2098
#define CLC3GLS3_G4D4T                2099
#define CLC4CON                       2100
#define LC4MODE                       2101
#define CLC4CON_MODE                  2102
#define LC4MODE0                      2103
#define CLC4CON_MODE0                 2104
#define LC4MODE1                      2105
#define CLC4CON_MODE1                 2106
#define LC4MODE2                      2107
#define CLC4CON_MODE2                 2108
#define LC4INTN                       2109
#define CLC4CON_INTN                  2110
#define CLC4CON_INTP                  2111
#define LC4INTP                       2112
#define CLC4CON_OUT                   2113
#define LC4OUT                        2114
#define CLC4CON_EN                    2115
#define LC4EN                         2116
#define CLC4POL                       2117
#define CLC4POL_G1POL                 2118
#define LC4G1POL                      2119
#define CLC4POL_G2POL                 2120
#define LC4G2POL                      2121
#define CLC4POL_G3POL                 2122
#define LC4G3POL                      2123
#define LC4G4POL                      2124
#define CLC4POL_G4POL                 2125
#define LC4POL                        2126
#define CLC4POL_POL                   2127
#define CLC4SEL0                      2128
#define CLC4SEL0_D1S0                 2129
#define LC4D1S0                       2130
#define CLC4SEL0_D1S                  2131
#define LC4D1S                        2132
#define CLC4SEL0_D1S1                 2133
#define LC4D1S1                       2134
#define CLC4SEL0_D1S2                 2135
#define LC4D1S2                       2136
#define CLC4SEL0_D1S3                 2137
#define LC4D1S3                       2138
#define CLC4SEL0_D1S4                 2139
#define LC4D1S4                       2140
#define CLC4SEL0_D1S5                 2141
#define LC4D1S5                       2142
#define CLC4SEL1                      2143
#define LC4D2S0                       2144
#define CLC4SEL1_D2S                  2145
#define CLC4SEL1_D2S0                 2146
#define LC4D2S                        2147
#define CLC4SEL1_D2S1                 2148
#define LC4D2S1                       2149
#define LC4D2S2                       2150
#define CLC4SEL1_D2S2                 2151
#define LC4D2S3                       2152
#define CLC4SEL1_D2S3                 2153
#define LC4D2S4                       2154
#define CLC4SEL1_D2S4                 2155
#define LC4D2S5                       2156
#define CLC4SEL1_D2S5                 2157
#define CLC4SEL2                      2158
#define LC4D3S                        2159
#define CLC4SEL2_D3S                  2160
#define CLC4SEL2_D3S0                 2161
#define LC4D3S0                       2162
#define LC4D3S1                       2163
#define CLC4SEL2_D3S1                 2164
#define CLC4SEL2_D3S2                 2165
#define LC4D3S2                       2166
#define CLC4SEL2_D3S3                 2167
#define LC4D3S3                       2168
#define CLC4SEL2_D3S4                 2169
#define LC4D3S4                       2170
#define CLC4SEL2_D3S5                 2171
#define LC4D3S5                       2172
#define CLC4SEL3                      2173
#define LC4D4S0                       2174
#define LC4D4S                        2175
#define CLC4SEL3_D4S0                 2176
#define CLC4SEL3_D4S                  2177
#define LC4D4S1                       2178
#define CLC4SEL3_D4S1                 2179
#define LC4D4S2                       2180
#define CLC4SEL3_D4S2                 2181
#define LC4D4S3                       2182
#define CLC4SEL3_D4S3                 2183
#define LC4D4S4                       2184
#define CLC4SEL3_D4S4                 2185
#define LC4D4S5                       2186
#define CLC4SEL3_D4S5                 2187
#define CLC4GLS0                      2188
#define CLC4GLS0_D1N                  2189
#define LC4G1D1N                      2190
#define CLC4GLS0_D1T                  2191
#define LC4G1D1T                      2192
#define CLC4GLS0_D2N                  2193
#define LC4G1D2N                      2194
#define CLC4GLS0_D2T                  2195
#define LC4G1D2T                      2196
#define CLC4GLS0_D3N                  2197
#define LC4G1D3N                      2198
#define CLC4GLS0_D3T                  2199
#define LC4G1D3T                      2200
#define CLC4GLS0_D4N                  2201
#define LC4G1D4N                      2202
#define CLC4GLS0_D4T                  2203
#define LC4G1D4T                      2204
#define CLC4GLS1                      2205
#define CLC4GLS1_D1N                  2206
