tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18345_tdd.h
#define LC4G2D1N                      2207
#define CLC4GLS1_D1T                  2208
#define LC4G2D1T                      2209
#define LC4G2D2N                      2210
#define CLC4GLS1_D2N                  2211
#define LC4G2D2T                      2212
#define CLC4GLS1_D2T                  2213
#define CLC4GLS1_D3N                  2214
#define LC4G2D3N                      2215
#define LC4G2D3T                      2216
#define CLC4GLS1_D3T                  2217
#define CLC4GLS1_D4N                  2218
#define LC4G2D4N                      2219
#define CLC4GLS1_D4T                  2220
#define LC4G2D4T                      2221
#define CLC4GLS2                      2222
#define CLC4GLS2_D1N                  2223
#define LC4G3D1N                      2224
#define CLC4GLS2_D1T                  2225
#define LC4G3D1T                      2226
#define LC4G3D2N                      2227
#define CLC4GLS2_D2N                  2228
#define LC4G3D2T                      2229
#define CLC4GLS2_D2T                  2230
#define CLC4GLS2_D3N                  2231
#define LC4G3D3N                      2232
#define CLC4GLS2_D3T                  2233
#define LC4G3D3T                      2234
#define LC4G3D4N                      2235
#define CLC4GLS2_D4N                  2236
#define LC4G3D4T                      2237
#define CLC4GLS2_D4T                  2238
#define CLC4GLS3                      2239
#define CLC4GLS3_G4D1N                2240
#define LC4G4D1N                      2241
#define LC4G4D1T                      2242
#define CLC4GLS3_G4D1T                2243
#define LC4G4D2N                      2244
#define CLC4GLS3_G4D2N                2245
#define LC4G4D2T                      2246
#define CLC4GLS3_G4D2T                2247
#define CLC4GLS3_G4D3N                2248
#define LC4G4D3N                      2249
#define CLC4GLS3_G4D3T                2250
#define LC4G4D3T                      2251
#define LC4G4D4N                      2252
#define CLC4GLS3_G4D4N                2253
#define LC4G4D4T                      2254
#define CLC4GLS3_G4D4T                2255
#define STATUS_SHAD                   2256
#define C_SHAD                        2257
#define DC_SHAD                       2258
#define Z_SHAD                        2259
#define WREG_SHAD                     2260
#define BSR_SHAD                      2261
#define PCLATH_SHAD                   2262
#define FSR0L_SHAD                    2263
#define FSR0H_SHAD                    2264
#define FSR1L_SHAD                    2265
#define FSR1H_SHAD                    2266
#define STKPTR                        2267
#define TOSL                          2268
#define TOSH                          2269

#endif // _PIC16F18345_H_
